app/controllers/admin/administrator_controller.rb

SELECT count(*) AS count_all FROM `documents` WHERE (documents.published=1)
SELECT count(*) AS count_all FROM `filelists`
SELECT sum(`filelists`.f_file_size) AS sum_f_file_size FROM `filelists`
SELECT count(*) AS count_all FROM `users`
SELECT * FROM `documents` ORDER BY hits desc LIMIT 10
SELECT * FROM `filelists` ORDER BY id desc LIMIT 10
---
  def index
    @documents_count = Document.count
    @files_count = Filelist.count
    @sum_files_size = Filelist.sum('f_file_size')
    @published_docuemnt_count = Document.published.count
    @approved_document_count = Document.approved.count
    @users_cout = User.count

    @popular_documents = Document.popular 10
    @last_documents = Document.all(:limit => 10, :order => 'id desc')
    @last_files = Filelist.all(:limit => 10, :order => 'id desc')