app/controllers/admin/documents_controller.rb

SELECT * FROM `categories` WHERE (section_id=34)
---
  def new
    @document = Document.new
    @categories = Category.find(:all, :conditions => ['section_id=?',@sections.first.id])

INSERT INTO `filelists` (`f_file_size`, `created_at`, `updated_at`, `f_content_type`, `f_updated_at`, `f_file_name`) VALUES(2066, '2011-04-14 13:55:50', '2011-04-14 13:55:50', 'image/png', '2011-04-14 13:55:50', 'sign.png')
INSERT INTO `document_files` (`document_id`, `filelist_id`, `created_at`, `updated_at`) VALUES(11, 33, '2011-04-14 13:55:50', '2011-04-14 13:55:50')
SELECT * FROM `document_files` WHERE (`document_files`.document_id = 10)
SELECT * FROM `documents` WHERE (`documents`.`id` = 11)
SELECT * FROM `filelists` WHERE (`filelists`.`id` = 35)
SELECT sum(`filelists`.f_file_size) AS sum_f_file_size FROM `filelists` INNER JOIN `document_files` ON `filelists`.id = `document_files`.filelist_id WHERE ((`document_files`.document_id = 10))
---
  def update
    add_images = params[:added_documentfilelist_ids]
    del_images = params[:deleted_documentfilelist_ids]

    if params[:screenshot].present?
      screenshot = Screenshot.new params[:screenshot]
      @document.screenshots << screenshot if screenshot && screenshot.valid? && screenshot.save
    end
    @logo = Logo.new params[:logo] if params[:logo].present?
    if @logo && @logo.valid? && @logo.save
      @document.logo.destroy if @document.logo.present?
      @document.logo = @logo
    end
    update_attributes_and_redirect(@document,params[:document]) do
      @file = Filelist.new params[:file] if params[:file].present?
      if @file && @file.valid? && @file.save
         @document.filelists << @file
      end

      #  Adding images
      add_images.each do |file_id|
        file = Filelist.get(file_id).first
        @document.filelists << file if file
      end if add_images

      #  Deleting images
      @document.document_files.where('id in (?)',del_images).delete_all if del_images

DELETE FROM `documents` WHERE `id` = 12
---
  def destroy
    confirm_multiple_operations params[:ids] do
      if Document.destroy_all(['id in (?)',session[current_session_ids]])

SELECT * FROM `sections`
---
  def load_section
    @sections = Section.all

SELECT * FROM `categories` WHERE (`categories`.section_id = 37)
---
  def load_categories_at_params
    @categories = Category.find(:all, :conditions => ['section_id=?',params[:section_id]])