app/controllers/admin/documents_controller.rb

  def file_add
    @file = Filelist.get(params[:id]).first
    @document = Document.get(params[:document_id]).first
    @document.filelists << @file if @file.present? and @document.present?
    @docfile = @document.document_files.find_by_filelist_id(params[:id])
---
SELECT * FROM `filelists` WHERE (filelists.id = '35') LIMIT 1
SELECT * FROM `documents` WHERE (documents.id = '13') LIMIT 1
INSERT INTO `document_files` (`document_id`, `filelist_id`, `created_at`, `updated_at`) VALUES(13, 35, '2011-04-15 14:42:09', '2011-04-15 14:42:09')
SELECT * FROM `document_files` WHERE (`document_files`.`filelist_id` = '35') AND (`document_files`.document_id = 13) LIMIT 1