app/controllers/admin/sections_controller.rb

  def destroy
    confirm_multiple_operations params[:ids] do
      if Section.destroy_all(['id in (?)',session[current_session_ids]])
---
DELETE FROM `sections` WHERE `id` = 39