app/controllers/catalog_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = '29') LIMIT 1
SELECT * FROM `sections`
SELECT `categories`.* FROM `categories` INNER JOIN `sections` ON `sections`.id = `categories`.section_id WHERE (section_id='34')
---
  def documents
    @categories = Category.getlist.section(params[:section_id])
    if (params[:category_id].present? and Category.find_by_id(params[:category_id]).nil?) or (not @categories.present?)
      redirect_to home_url and return
    end
    @documents = Document.getlist.section(params[:section_id]).category(params[:category_id]).paginate :page => params[:page], :per_page => 5