app/controllers/dialogs_controller.rb

  def show_dialog
#   Generate template dialog
    if params[:dialog_name]
      @template_dir = "/dialogs/forms/#{params[:dialog_name]}/show"
    else
      render :none
    end

    @dialogdata = dialog_category_data if params[:dialog_name].eql?('category')

    if params[:dialog_name].eql?('fetch_category')
      @categories = Category.getlist.section(params[:id]).order('name')
      @inline_object = 'dialog_category_list'
      @template_dir = 'dialogs/forms/category/categories'
    end

    filelist if params[:dialog_name].eql?('filelist')
    static_content if params[:dialog_name].eql?('static_content')

    if params[:dialog_name].eql?('manager_logo')
      document = Document.where(:id => params[:id]).limit(1).first
---
SELECT * FROM `sections` ORDER BY name
SELECT * FROM `documents` WHERE (documents.id = '13') LIMIT 1